tests/fixtures/instalment_schedules.json

{ 
  "create_with_dates": {
    "method": "POST",
    "path_template": "/instalment_schedules",
    "url_params": {},
    "body": {"instalment_schedules":{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000}}
  },
  "create_with_schedule": {
    "method": "POST",
    "path_template": "/instalment_schedules",
    "url_params": {},
    "body": {"instalment_schedules":{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000}}
  },
  "list": {
    "method": "GET",
    "path_template": "/instalment_schedules",
    "url_params": {},
    "body": {"instalment_schedules":[{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000},{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000}],"meta":{"cursors":{"after":"example after 9386","before":"example before 8996"},"limit":50}}
  },
  "get": {
    "method": "GET",
    "path_template": "/instalment_schedules/:identity",
    "url_params": {"identity": "IS123"},
    "body": {"instalment_schedules":{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000}}
  },
  "update": {
    "method": "PUT",
    "path_template": "/instalment_schedules/:identity",
    "url_params": {"identity": "IS123"},
    "body": {"instalment_schedules":{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000}}
  },
  "cancel": {
    "method": "POST",
    "path_template": "/instalment_schedules/:identity/actions/cancel",
    "url_params": {"identity": "IS123"},
    "body": {"instalment_schedules":{"created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","id":"IS123","links":{"customer":"CU123","mandate":"MD123","payments":["PM123","PM456"]},"metadata":{},"name":"Invoice 4404","payment_errors":{"0":[],"1":{"field":"charge_date","message":"must be on or after mandate's next_possible_customer_charge_date"}},"status":"active","total_amount":1000}}
  }
}

